9/data/attachments/21ca60b09a62c7cc.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_7340a7a1-5568-4c98-9752-5bc1cb4e4cee</nif:username>
            <nif:friendToBeAdded>Shawn_message_Actions_83459_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>